Функция GetJSON(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	
	НаименованиеСправочника = Запрос.ПараметрыЗапроса.Получить("NameObject");
	
	Значение = Справочники.ФСК_ВходящиеПретензии.НайтиПоНаименованию(НаименованиеСправочника);
	МетаданныеЗначения = Значение.Метаданные();
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	
	// Основные реквизиты
	ЗначениеРеквизитов = Новый Структура;
	
	Для каждого Реквизит Из МетаданныеЗначения.Реквизиты Цикл
		
		ИмяРеквизита = Реквизит.Имя;
		ЗначениеРеквизитов.Вставить(
			СтроковыеФункции.СтрокаЛатиницей(ИмяРеквизита),
			Строка(Значение[ИмяРеквизита])
		);
		
	КонецЦикла;
	
	// Табличные части
	Для каждого ТабличнаяЧасть Из МетаданныеЗначения.ТабличныеЧасти Цикл
		
		ИмяТабличнойЧасти = ТабличнаяЧасть.Имя;
		Таблица = Значение[ИмяТабличнойЧасти];
		
		МассивСтрок = Новый Массив;
		
		Для каждого СтрокаТабличнойЧасти Из Таблица Цикл
			
			ДанныеСтроки = Новый Структура;
			
			Для каждого Колонка Из ТабличнаяЧасть.Реквизиты Цикл
				
				ИмяКолонки = Колонка.Имя;
				
				ДанныеСтроки.Вставить(
					СтроковыеФункции.СтрокаЛатиницей(ИмяКолонки),
					Строка(СтрокаТабличнойЧасти[ИмяКолонки])
				);
				
			КонецЦикла;
			
			МассивСтрок.Добавить(ДанныеСтроки);
			
		КонецЦикла;
		
		ЗначениеРеквизитов.Вставить(
			СтроковыеФункции.СтрокаЛатиницей(ИмяТабличнойЧасти),
			МассивСтрок
		);
		
	КонецЦикла;
	
	ЗаписатьJSON(ЗаписьJSON, ЗначениеРеквизитов);
	СериализованнаяСтрока = ЗаписьJSON.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(СериализованнаяСтрока);
	
	Возврат Ответ;
	
КонецФункции